<a href="https://colab.research.google.com/github/Joanharon/Joanharon/blob/main/Moringa_Data_Science_Prep_W3_Independent_Project_2021_08_Joan_Haron_Python_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
 #Let's import the pandas library 

import pandas as pd

In [ ]:
#Creating our database from csv file
df = pd.read_csv('cells_geo.csv')
df.head()

  ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE
0  0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
1  1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
2  2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
3  3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
4  4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...

In [ ]:
#Creating our second database from excel
df1= pd.read_excel('CDR_description.xlsx')
df1.head()

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String

In [ ]:
#Creating our third database from excel
df2 = pd.read_excel('cells_geo_description.xlsx')
df2.head()

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

In [ ]:
#Creating dataframe 1 from URL
Tel_data_set1 = pd.read_csv("http://bit.ly/TelecomDataset1")
Tel_data_set1.head()

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
#Creating dataframe 2 from URL
Tel_data_set2 = pd.read_csv("http://bit.ly/TelecomDataset2")
Tel_data_set2.head()

NameError: ignored

In [ ]:
#Creating dataframe 3 from URL
Tel_data_set3 = pd.read_url("http://bit.ly/TelecomDataset3")
Tel_data_set3.head()

In [ ]:
#Cleaning first dataframe i.e. the cells_geo.csv

#Checking if there is any null or duplicate 
df.isnull().values.any()
df.duplicated()

#CLEANING THE FIRST TELECOM DATASET.
#First we drop the columns we will not need
Tel_data_set1.drop('COUNTRY_A' , axis = 1 ,inplace = True)
Tel_data_set1.drop('COUNTRY_B' , axis = 1 ,inplace = True)

#Check for duplicates
Tel_data_set1.duplicated()
Tel_data_set1 = Tel_data_set1.drop_duplicates()
Tel_data_set1.head()

#CLEANING THE SECOND TELECOM DATASET.
#First we drop the columns we will not use 
Tel_data_set2.drop('COUNTRY_A ' , axis = 1 ,inplace = True)
Tel_data_set2.drop('COUNTRY B' , axis = 1 ,inplace = True)

#check for duplicates and any null and replace nulls.
Tel_data_set2.duplicated()
Tel_data_set2.drop_duplicates()
Tel_data_set2.isnull().values.any()
Tel_data_set2 = Tel_data_set2.fillna('Not Identified')
Tel_data_set2.head()
 

#CLEANING THE THIRD TELECOM DATASET
#Dropping the columns we will not be using
Tel_data_set3.drop('COUNTRY_A' , axis = 1 ,inplace = True)
Tel_data_set3.drop('COUNTRY_B' , axis = 1 ,inplace = True)

#Check for duplicates,nulls and replace the nulls
Tel_data_set3.duplicated()
Tel_data_set2.drop_duplicates()
Tel_data_set3.isnull().values.any()
Tel_data_set3 = Tel_data_set2.fillna('Not Identified')
Tel_data_set3.head()

#When Merging, Some columns may not merge cause of spelling errors from the other dataframes.
#We need to check the spellings on the columns we have and check its okay spelt.
Tel_data_set1.columns.values[2:3] = ['DATE_TIME']
Tel_data_set1.columns.values[0:1] = ['PRODUCT']

Tel_data_set2.columns.value[3:5] = ['DW_A_NUMBER_INT' , 'DW_B_NUMBER_INT']

Tel_data_set3.columns.value[5:] = ['CELL_ID' , 'SITE_ID']

In [ ]:
#MERGING.
#Merge the telecom data sets
TelecomData = pd.concat(Tel_data_set1 , Tel_data_set2 , Tel_data_set3)
TelecomData

#Merge the other datasets with the telecome data.
Dataframe = pd.merge(df,TelecomData, how = 'inner' , left_on = 'SITE_ID' , right_on = 'SITE_CODE')
Dataframe

In [ ]:
#DATA ANALYSIS.
#First, we load our merged data
Dataframe

In [ ]:
#Regions and their use of the products
Dataframe['REGION'] .value_counts()

In [ ]:
#Cities and their usage
Dataframe['VILLES'] .value_counts()

In [ ]:
#The most used product in the 3 days
Dataframe.groupby ('PRODUCT')('VALUE') .sum()

ValueError: ignored